--- a/source/_posts/2021-06-02-using-rxswift.md
+++ b/source/_posts/2021-06-02-using-rxswift.md
@@ -81,31 +76,42 @@ Observable<String>.create {
 
-### 2. ReactiveCocoa 3.x 依赖图
+### 2. RxSwift vs ReactiveCocoa
+```plantuml
+@startuml
+rectangle "RxSwift vs ReactiveCocoa" {
+    package "ReactiveCocoa 3.x" {
+        rectangle ReactiveObjCBridge
+        rectangle ReactiveSwift
+        rectangle ReactiveCocoa
+
+        rectangle "ReactiveCocoa 2.x" {
+            rectangle ReactiveObjC
+            
+            ReactiveCocoa ...> ReactiveSwift
+            ReactiveObjCBridge ...> ReactiveSwift
+            ReactiveObjCBridge ...> ReactiveObjC
+        }
+    }
+
+    package "RxSwift 6.x" {
+        rectangle RxSwift
+        rectangle RxRelay
+        rectangle RxTest
+        rectangle RxBlocking
+        rectangle RxCocoa
+
+        RxRelay ..> RxSwift
+        RxTest ..> RxSwift
+        RxBlocking ..> RxSwift
+        RxCocoa ..> RxSwift
+        RxCocoa ..> RxRelay
+    }
+}
+@enduml
+```
 
 ReactiveCocoa 借用了大量 Rx 概念，是一套 “函数响应式编程” 的 iOS 库，自成一体。千万不要和 RxSwift 搞混了。
-
-```mermaid
-graph BT;
-	C(ReactiveObjCBridge) -.-> A(ReactiveSwift);
-	subgraph ReactiveCocoa 2.x
-	B(ReactiveObjC);
-    end
-	C(ReactiveObjCBridge) -.-> B(ReactiveObjC)
-	D(ReactiveCocoa) -.-> A(ReactiveSwift);
-```
-
-### 3. RxSwift 6.x 依赖图
-
@@ -215,22 +221,39 @@ Observable<Int>.from([2, 4, 6, 8]).map { $0 + 1 }.toArray().subscribe { print($0
 
 ## 四、订阅和发布
 
-```mermaid
-graph TB
-	subgraph 发布/订阅模式
-	style C fill: #f9a, stroke: #333, stroke-width: 1px;
-	style E fill: #f9a, stroke: #333, stroke-width: 1px;
-	C(Publisher) -->|"Pushlish topic(event)"| D((Topic<br>Event Channel));
-	E(Observer) -->|Subscribe| D((Topic<br>Event Channel));
-	D((Topic<br>Event Channel)) -->|Fire Event| E(Subscriber);
-	end
+```plantuml
+@startuml
+rectangle "设计模式" {
 
-	subgraph 观察者模式
-	style A fill: #f9a, stroke: #333, stroke-width: 1px;
-	style B fill: #f9a, stroke: #333, stroke-width: 1px;
-	B(Observer) -->|Subscribe| A(Subject);
-	A(Subject) -->|Fire Event| B(Observer);
-	end;
+    frame "发布/订阅模式" {
+        rectangle Publisher
+        rectangle Subscriber1
+        rectangle Subscriber2
+
+        storage "Event Channel" as EC #aliceblue;line:blue;line.dotted;text:blue
+
+        Publisher --> EC : Publish Event
+
+        EC --> Subscriber1 : Fire Event
+        Subscriber1 ..|> EC : Subscribe
+
+        EC --> Subscriber2 : Fire Event
+        Subscriber2 ..|> EC : Subscribe
+    }
+
+    frame "观察者模式" {
+        rectangle Subject
+        rectangle Observer1
+        rectangle Observer2
+
+        Subject --> Observer1 : Fire Event
+        Observer1 ..|> Subject : Subscribe
+
+        Subject --> Observer2 : Fire Event
+        Observer2 ..|> Subject : Subscribe
+    }
+}
+@enduml
 ```
 
 ### 1. 观察者模式
